# Задача 1. Вариант 4.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Фредерик Аустерлиц. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Beglova A. A.
# 13.06.2016

print ("Фредерик Аустерлиц - американский актёр, танцор, хореограф и певец, звезда Голливуда, один из величайших мастеров музыкального жанра в кино")

input ("Нажмите Enter для выхода.")
