# Задача 3. Вариант 4.
# Напишите программу, которая выводит имя "Уильям Сидни Портер", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Beglova A. A.
# 13.06.2016

print ("Под каким псевдонимом известен Уильям Сидни Портер?")
answer = input ("Ваш ответ: ")
print ("Верно: Уильям Сидни Портер - "+answer)

input("\nДля выхода нажмите Enter")
