# Задача 2. Вариант 4.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сократ. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Beglova A. A.
# 13.06.2016

print ("Кто хочет делать — ищет способ, кто не хочет — ищет причину.")
print ("Сократ\n")

input ("Нажмите Enter для выхода.")
